#+TITLE: 17.org
#+AUTHOR: Jeong Hoon Choi
#+DATE: 2024.02.28

* Multi-Modality
#+begin_src python :results output

import tensorflow as tf
from tensorflow import keras
from tensorflow.keras.utils import to_categorical
from tensorflow.keras.preprocessing.text import Tokenizer, text_to_word_sequence
from tensorflow.keras.preprocessing.sequence import pad_sequences
from tensorflow.keras.layers import Input, Embedding, LSTM, Flatten, Concatenate, Dense
from tensorflow.keras.models import Model
import numpy as np
import matplotlib.pyplot as plt
import logging

tf.get_logger().setLevel(logging.ERROR)

EPOCHS=20
MAX_WORDS=8
EMBEDDING_WIDTH=4

mnist=keras.datasets.mnist
(train_images, train_labels), (test_images, test_labels)=mnist.load_data()

mean=np.mean(train_images)
stddev=np.std(train_images)
train_images=(train_images-mean)/stddev
test_images=(test_images-mean)/stddev

def create_text(tokenizer, labels):
    text=[]
    for i, label in enumerate(labels):
        if i%2==0:
            if label<5:
                text.append("LOWER HALF")
            else:
                text.append("UPPER HALF")
        else:
            if label%2==0:
                text.append("EVEN NUMBER")
            else:
                text.append("ODD NUMBER")
    text=tokenizer.texts_to_sequences(text)
    text=pad_sequences(text)
    return text

vocabulary=["LOWER", "UPPER", "HALF", "EVEN", "ODD", "NUMBER"]
tokenizer=Tokenizer(num_words=MAX_WORDS)
tokenizer.fit_on_texts(vocabulary)
train_text=create_text(tokenizer, train_labels)
test_text=create_text(tokenizer, test_labels)

image_input=Input(shape=(28, 28))
text_input=Input(shape=(2, ))

embedding_layer=Embedding(output_dim=EMBEDDING_WIDTH, input_dim=MAX_WORDS)
lstm_layer=LSTM(8)
flatten_layer=Flatten()
concat_layer=Concatenate()
dense_layer=Dense(25, activation="relu")
output_layer=Dense(10, activation="softmax")

embedding_output=embedding_layer(text_input)
lstm_output=lstm_layer(embedding_output)
flatten_output=flatten_layer(image_input)
concat_output=concat_layer([lstm_output, flatten_output])
dense_output=dense_layer(concat_output)
outputs=output_layer(dense_output)

model=Model([image_input, text_input], outputs)
model.compile(loss="sparse_categorical_crossentropy",
              optimizer="adam", metrics=["accuracy"])
model.summary()

history=model.fit([train_images, train_text], train_labels,
                  validation_data=([test_images, test_text], test_labels),
                  epochs=EPOCHS, batch_size=64, verbose=0, shuffle=True)

print(test_labels[0])
print(tokenizer.sequences_to_texts([test_text[0]]))
plt.figure(figsize=(1, 1))
plt.imshow(test_images[0], cmap=plt.get_cmap("gray"))
plt.show()

y=model.predict([test_images[0:1], np.array(tokenizer.texts_to_sequences(["UPPER HALF"]))])[0]
print("Predictions with correct input: ")
for i in range(len(y)):
    index=y.argmax()
    print("Digit: %d, " %index, "probability: %5.2e" %y[index])
    y[index]=0

print("\nPredictions with incorrect input: ")
y=model.predict([test_images[0:1], np.array(tokenizer.texts_to_sequences(["LOWER HALF"]))])[0]
for i in range(len(y)):
    index=y.argmax()
    print("Digit: %d, " %index, "probability: %5.2e" %y[index])
    y[index]=0

#+end_src

#+RESULTS:
#+begin_example
Model: "model"
__________________________________________________________________________________________________
 Layer (type)                Output Shape                 Param #   Connected to                  
==================================================================================================
 input_2 (InputLayer)        [(None, 2)]                  0         []                            
                                                                                                  
 embedding (Embedding)       (None, 2, 4)                 32        ['input_2[0][0]']             
                                                                                                  
 input_1 (InputLayer)        [(None, 28, 28)]             0         []                            
                                                                                                  
 lstm (LSTM)                 (None, 8)                    416       ['embedding[0][0]']           
                                                                                                  
 flatten (Flatten)           (None, 784)                  0         ['input_1[0][0]']             
                                                                                                  
 concatenate (Concatenate)   (None, 792)                  0         ['lstm[0][0]',                
                                                                     'flatten[0][0]']             
                                                                                                  
 dense (Dense)               (None, 25)                   19825     ['concatenate[0][0]']         
                                                                                                  
 dense_1 (Dense)             (None, 10)                   260       ['dense[0][0]']               
                                                                                                  
==================================================================================================
Total params: 20533 (80.21 KB)
Trainable params: 20533 (80.21 KB)
Non-trainable params: 0 (0.00 Byte)
__________________________________________________________________________________________________
7
['upper half']
1/1 [==============================] - ETA: 0s 1/1 [==============================] - 0s 260ms/step
Predictions with correct input: 
Digit: 7,  probability: 1.00e+00
Digit: 9,  probability: 6.42e-07
Digit: 8,  probability: 3.57e-10
Digit: 3,  probability: 8.00e-11
Digit: 5,  probability: 3.10e-13
Digit: 6,  probability: 9.41e-16
Digit: 0,  probability: 8.79e-16
Digit: 2,  probability: 5.15e-18
Digit: 4,  probability: 6.27e-20
Digit: 1,  probability: 4.94e-21

Predictions with incorrect input: 
1/1 [==============================] - ETA: 0s 1/1 [==============================] - 0s 7ms/step
Digit: 3,  probability: 4.52e-01
Digit: 7,  probability: 4.38e-01
Digit: 2,  probability: 6.64e-02
Digit: 0,  probability: 4.38e-02
Digit: 1,  probability: 5.81e-07
Digit: 9,  probability: 4.86e-07
Digit: 4,  probability: 4.47e-07
Digit: 8,  probability: 2.08e-07
Digit: 6,  probability: 2.03e-12
Digit: 5,  probability: 3.17e-15
#+end_example

* Multi-Task Training
#+begin_src python :results output

import tensorflow as tf
from tensorflow import keras
from tensorflow.keras.utils import to_categorical
from tensorflow.keras.preprocessing.text import Tokenizer, text_to_word_sequence
from tensorflow.keras.preprocessing.sequence import pad_sequences
from tensorflow.keras.layers import Input, Embedding, LSTM, Flatten, Concatenate, Dense
from tensorflow.keras.models import Model
import numpy as np
import logging

tf.get_logger().setLevel(logging.ERROR)

EPOCHS=20
MAX_WORDS=8
EMBEDDING_WIDTH=4

mnist=keras.datasets.mnist
(train_images, train_labels), (test_images, test_labels)=mnist.load_data()
mean=np.mean(train_images)
stddev=np.std(train_images)

train_images=(train_images-mean)/stddev
test_images=(test_images-mean)/stddev

def create_question_answer(tokenizer, labels):
    text=[]
    answers=np.zeros(len(labels))
    for i, label in enumerate(labels):
        question_num=i%4
        if question_num==0:
            text.append("LOWER HALF")
            if label<5:
                answers[i]=1.0
        elif question_num==1:
            text.append("UPPER HALF")
            if label>=5:
                answers[i]=1.0
        elif question_num==2:
            text.append("EVEN NUMBER")
            if label%2==0:
                answers[i]=1.0
        elif question_num==3:
            text.append("ODD NUMBER")
            if label%2==1:
                answers[i]=1.0
    text=tokenizer.texts_to_sequences(text)
    text=pad_sequences(text)
    return text, answers

vocabulary=["LOWER", "UPPER", "HALF", "EVEN", "ODD", "NUMBER"]
tokenizer=Tokenizer(num_words=MAX_WORDS)
tokenizer.fit_on_texts(vocabulary)
train_text, train_answers=create_question_answer(tokenizer, train_labels)
test_text, test_answers=create_question_answer(tokenizer, test_labels)

image_input=Input(shape=(28, 28))
text_input=Input(shape=(2, ))

embedding_layer=Embedding(output_dim=EMBEDDING_WIDTH, input_dim=MAX_WORDS)
lstm_layer=LSTM(8)
flatten_layer=Flatten()
concat_layer=Concatenate()
dense_layer=Dense(25, activation="relu")
class_output_layer=Dense(10, activation="softmax")
answer_output_layer=Dense(1, activation="sigmoid")

embedding_output=embedding_layer(text_input)
lstm_output=lstm_layer(embedding_output)
flatten_output=flatten_layer(image_input)
concat_output=concat_layer([lstm_output, flatten_output])
dense_output=dense_layer(concat_output)
class_outputs=class_output_layer(dense_output)
answer_outputs=answer_output_layer(dense_output)

model=Model([image_input, text_input], [class_outputs, answer_outputs])
model.compile(loss=["sparse_categorical_crossentropy", "binary_crossentropy"], optimizer="adam",
             metrics=["accuracy"], loss_weights=[0.5, 0.5])
model.summary()

history=model.fit([train_images, train_text],
                  [train_labels, train_answers],
                  validation_data=(
                      [test_images, test_text],
                      [test_labels, test_answers]
                  ),
                  epochs=EPOCHS, batch_size=64, verbose=0, shuffle=True)

#+end_src

#+RESULTS:
#+begin_example
Model: "model"
__________________________________________________________________________________________________
 Layer (type)                Output Shape                 Param #   Connected to                  
==================================================================================================
 input_2 (InputLayer)        [(None, 2)]                  0         []                            
                                                                                                  
 embedding (Embedding)       (None, 2, 4)                 32        ['input_2[0][0]']             
                                                                                                  
 input_1 (InputLayer)        [(None, 28, 28)]             0         []                            
                                                                                                  
 lstm (LSTM)                 (None, 8)                    416       ['embedding[0][0]']           
                                                                                                  
 flatten (Flatten)           (None, 784)                  0         ['input_1[0][0]']             
                                                                                                  
 concatenate (Concatenate)   (None, 792)                  0         ['lstm[0][0]',                
                                                                     'flatten[0][0]']             
                                                                                                  
 dense (Dense)               (None, 25)                   19825     ['concatenate[0][0]']         
                                                                                                  
 dense_1 (Dense)             (None, 10)                   260       ['dense[0][0]']               
                                                                                                  
 dense_2 (Dense)             (None, 1)                    26        ['dense[0][0]']               
                                                                                                  
==================================================================================================
Total params: 20559 (80.31 KB)
Trainable params: 20559 (80.31 KB)
Non-trainable params: 0 (0.00 Byte)
__________________________________________________________________________________________________
#+end_example

